     A* PRINTER FILE : HRRPAY - PAYROLL REGISTER
     A          R RHEAD                     SKIPB(01)
     A                                  1 26'TAJ HOTEL MUMBAI'
     A                                  2 28'PAYROLL REGISTER'
     A                                  3 20'Period:'
     A            PPER           7A  O  3 28
     A                                  5  4'EmpID'
     A                                  5 12'Name'
     A                                  5 38'Dept'
     A                                  5 46'Basic'
     A                                  5 58'HRA'
     A                                  5 68'Net'
     A          R RDETL                     SPACEB(01)
     A            DEID           6S  O     4
     A            DNAME         24A  O    12
     A            DDPT           6A  O    38
     A            DBASIC        10S 2O    45
     A            DHRA          10S 2O    56
     A            DNET          12S 2O    67
     A          R RTOT                      SPACEB(02)
     A                                     4'TOTAL NET PAYROLL'
     A            TNET          14S 2O    65
